import React from "react";

const Reliability = () => {
    return (
        <div>
            <p>Разработка веб-приложений требует знания различных языков и инструментов. В зависимости от стека
                технологий, выбранных для разработки, можно выделить две основные составляющие веб-приложения: frontend
                и backend.
            </p>
            <p>Для разработки frontend части веб-приложения используются различные языки программирования и
            фреймворки. Наиболее популярные из них - это Angular, React и Vue.
        </p>
            <p>Angular - это полноценный фреймворк для разработки веб-приложений, который используется для создания
            крупных и сложных проектов. Он предоставляет множество инструментов и компонентов для создания
            пользовательского интерфейса, управления состоянием приложения и взаимодействия с сервером.
            Vue - это прогрессивный фреймворк для создания веб-приложений, который легко изучать и использовать. Он обеспечивает быстрое создание интерфейсов, а также имеет встроенные возможности для управления состоянием и маршрутизации.
        </p>
            <p>React - это библиотека JavaScript, которая позволяет создавать пользовательский интерфейс веб-приложений.
            Его основное преимущество - это быстродействие, так как он использует виртуальный DOM для уменьшения времени
            перерисовки страницы.
        </p>
            <p>Backend составляющая веб-приложения, в свою очередь, требует знания других языков программирования и
            инструментов. Наиболее популярными языками программирования для создания backend веб-приложений являются
            PHP, C# и Python.
        </p>
            <p>PHP - это язык программирования, который используется для создания динамических веб-сайтов и приложений.
            Laravel - это фреймворк PHP, который позволяет быстро создавать веб-приложения и упрощает процесс
            разработки.</p>

        </div>
    )
};

export default Reliability;